#ifndef MANAGER_H
#define MANAGER_H
#include "Customer.h"
#include "Product.h"
typedef struct
{
	customer* customers;
	int ncus;
	product* products;
	int nprod;
}manager;
void suggestKelt(manager*);
void checkName(manager* );
void init(manager*)
//מבנה: ניהול
//- מצביע למערך לקוחות דינמי + גודל המערך(המערך ממוין לפי תז)
//- מצביע למערך מוצרים דינמי + גודל המערך
//1. הגדירי את מבני הנתונים הנדרשים.
//2. במחלקת הניהול כתבי פונקציה הקולטת הצעה מלקוח.
//
//הלקוח מקיש תז.אם לא נמצא במאגר הלקוחות(פונ & #39; חיפוש), יש להוסיפו תחילה למאגר.
//דאגי למיון המערך לפי תז – השתמשי בפונ& #39; qsort
//לאחר מכן הוא קולט את קוד המוצר שברצונו להציע עבורו במכרז. (בדקי שהקוד קים)
//לאחר הקליטה יש לבדוק האם ההצעה תקנית(במחיר המותר).אם לא, יש לקלוט שוב עד
//לקלט תקין.
//לאחר מכן יש להוסיף את ההצעה למערך ההצעות של המוצר(כדאי להוסיף בצורה ממויינת
//	כדי שיוכלו בקלות למצוא את הזוכים במכרז)
//
//	3. כתבי פונקציה הבודקת עבור כל מוצר מי הם שמות הלקוחות הזוכים במכרז ואת המחיר שהציעו.
#endif // !MANAGER_H
